; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v1 - type_3 ?v8 - type_1)
 	      (pred_4 ?v7 - object ?v8 - type_1)
	      (pred_3 ?v1 - type_3 ?v5 - type_2)
	      (pred_1 ?v1 - type_3 ?v7 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v2 ?v6 - type_1)
       :precondition (and  (pred_2 ?v1 ?v2))
       :effect (and  (pred_2 ?v1 ?v6)
		     (not (pred_2 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4) (pred_2 ?v1 ?v4) (pred_3 ?v1 ?v5))
       :effect (and (pred_1 ?v1 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v4)) 
		    (not (pred_3 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v3 ?v5) (pred_2 ?v1 ?v4))
       :effect (and (pred_4 ?v3 ?v4)
		    (pred_3 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_13 - type_3
obj_02 obj_04 obj_12 obj_08 - type_2
obj_14 obj_11 obj_09 obj_07 - type_1
obj_05 obj_10 obj_03 obj_06 - object)
(:init
(pred_2 obj_01 obj_09)
(pred_3 obj_01 obj_02)
(pred_3 obj_01 obj_04)
(pred_2 obj_13 obj_14)
(pred_3 obj_13 obj_12)
(pred_3 obj_13 obj_08)
(pred_4 obj_05 obj_14)
(pred_4 obj_10 obj_09)
(pred_4 obj_03 obj_09)
(pred_4 obj_06 obj_14)
)
(:goal
(and
(pred_4 obj_05 obj_09)
(pred_4 obj_10 obj_11)
(pred_4 obj_03 obj_14)
(pred_4 obj_06 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_01 obj_11) (pred_2 obj_13 obj_11))))
    (always (not (and (pred_2 obj_01 obj_09) (pred_2 obj_13 obj_09))))
  )
)
)

; plan
1. (op_1 obj_13 obj_06 obj_14 obj_08)
   deleted: (pred_4 obj_06 obj_14) (pred_3 obj_13 obj_08)
   added: (pred_1 obj_13 obj_06 obj_08)
   goals met: 0 of 4
2. (op_1 obj_13 obj_05 obj_14 obj_12)
   deleted: (pred_4 obj_05 obj_14) (pred_3 obj_13 obj_12)
   added: (pred_1 obj_13 obj_05 obj_12)
   goals met: 0 of 4
3. (op_1 obj_01 obj_03 obj_09 obj_04)
   deleted: (pred_4 obj_03 obj_09) (pred_3 obj_01 obj_04)
   added: (pred_1 obj_01 obj_03 obj_04)
   goals met: 0 of 4
4. (op_1 obj_01 obj_10 obj_09 obj_02)
   deleted: (pred_4 obj_10 obj_09) (pred_3 obj_01 obj_02)
   added: (pred_1 obj_01 obj_10 obj_02)
   goals met: 0 of 4
5. (op_2 obj_13 obj_14 obj_11)
   deleted: (pred_2 obj_13 obj_14)
   added: (pred_2 obj_13 obj_11)
   goals met: 0 of 4
6. (op_2 obj_01 obj_09 obj_14)
   deleted: (pred_2 obj_01 obj_09)
   added: (pred_2 obj_01 obj_14)
   goals met: 0 of 4
7. (op_3 obj_13 obj_06 obj_11 obj_08)
   deleted: (pred_1 obj_13 obj_06 obj_08)
   added: (pred_4 obj_06 obj_11) (pred_3 obj_13 obj_08)
   goals met: 1 of 4
8. (op_3 obj_01 obj_03 obj_14 obj_04)
   deleted: (pred_1 obj_01 obj_03 obj_04)
   added: (pred_4 obj_03 obj_14) (pred_3 obj_01 obj_04)
   goals met: 2 of 4
9. (op_2 obj_13 obj_11 obj_09)
   deleted: (pred_2 obj_13 obj_11)
   added: (pred_2 obj_13 obj_09)
   goals met: 2 of 4
10. (op_2 obj_01 obj_14 obj_11)
   deleted: (pred_2 obj_01 obj_14)
   added: (pred_2 obj_01 obj_11)
   goals met: 2 of 4
11. (op_3 obj_13 obj_05 obj_09 obj_12)
   deleted: (pred_1 obj_13 obj_05 obj_12)
   added: (pred_4 obj_05 obj_09) (pred_3 obj_13 obj_12)
   goals met: 3 of 4
12. (op_3 obj_01 obj_10 obj_11 obj_02)
   deleted: (pred_1 obj_01 obj_10 obj_02)
   added: (pred_4 obj_10 obj_11) (pred_3 obj_01 obj_02)
   goals met: 4 of 4
